In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Handle categorical feature

### - One hot enncoding

In [3]:
df =pd.read_csv("titanic_train.csv",usecols =['Sex'])

In [4]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [5]:
pd.get_dummies(df,drop_first=True).head(10)

   Sex_male
0         1
1         0
2         0
3         0
4         1
5         1
6         1
7         1
8         0
9         0

In [6]:
df =pd.read_csv("titanic_train.csv",usecols =['Embarked'])

In [7]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [8]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [9]:
df.dropna()

    Embarked
0          S
1          C
2          S
3          S
4          S
..       ...
886        S
887        S
888        S
889        C
890        Q

[889 rows x 1 columns]

In [10]:
pd.get_dummies(df,drop_first =True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [11]:
# oneh= hot encoding with many category in a feature
df=pd.read_csv("train.csv",usecols=['X0','X1','X2','X3','X4','X5'])

In [12]:
df.head()

   X0 X1  X2 X3 X4 X5
0   k  v  at  a  d  u
1   k  t  av  e  d  y
2  az  w   n  c  d  x
3  az  t   n  f  d  x
4  az  v   n  f  d  h

In [13]:
df.shape

(4209, 6)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X0      4209 non-null   object
 1   X1      4209 non-null   object
 2   X2      4209 non-null   object
 3   X3      4209 non-null   object
 4   X4      4209 non-null   object
 5   X5      4209 non-null   object
dtypes: object(6)
memory usage: 197.4+ KB

In [15]:
df.isnull().sum()

X0    0
X1    0
X2    0
X3    0
X4    0
X5    0
dtype: int64

In [20]:
for i in df.columns:
    print(i,":",len(df[i].unique()))
    
    
    
    #we are taking columns as i

X0 : 47
X1 : 27
X2 : 44
X3 : 7
X4 : 4
X5 : 29

In [33]:
df.X2.value_counts().sort_values(ascending=False).head(10)

as    1659
ae     496
ai     415
m      367
ak     265
r      153
n      137
s       94
f       87
e       81
Name: X2, dtype: int64

In [56]:
for j in range(0,5):
    lst_10=df["X"+str(j)].value_counts().sort_values(ascending=False).head(10).index
    for categories in lst_10:
        for i in range(0,5):
            df[categories]=np.where(df["X"+str(i)]==categories,1,0)

In [58]:
lst_10

['d', 'a', 'c', 'b']

In [54]:
for categories in lst_10:
    for i in range(0,5):
        df[categories]=np.where(df["X"+str(i)]==categories,1,0)

In [55]:
df.head()

   X0 X1  X2 X3 X4 X5  aa  s  b  l  ...  f  e  z  y  ay  t  x  w  d  g
0   k  v  at  a  d  u   0  0  0  0  ...  0  0  0  0   0  0  0  0  1  0
1   k  t  av  e  d  y   0  0  0  0  ...  0  0  0  0   0  0  0  0  1  0
2  az  w   n  c  d  x   0  0  0  0  ...  0  0  0  0   0  0  0  0  1  0
3  az  t   n  f  d  x   0  0  0  0  ...  0  0  0  0   0  0  0  0  1  0
4  az  v   n  f  d  h   0  0  0  0  ...  0  0  0  0   0  0  0  0  1  0

[5 rows x 32 columns]